distros/S/SOAP-DirectI/t/data/4.xml

 <?xml version="1.0" encoding="UTF-8"?>
  <SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:si="http://soapinterop.org/xsd" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="com.logicboxes.foundation.sfnb.user.Customer">
    <SOAP-ENV:Body>
      <impl:getCustomerId>
        <customerUsername xsi:type="xsd:string" >test@reg.ru</customerUsername>
      </impl:getCustomerId>
    </SOAP-ENV:Body>
  </SOAP-ENV:Envelope>
